class Translation(object):
    START_TEXT = """تم تصنيع البوت من اجل مساعدتك في الحصول على الايبيات لك من اجل سهولة والسرعة
━━━━━━━━━━━━━━━━━━━━━━━━
يرجى إدخال رقم هاتفك بتنسيق رمز الدولة.
مثال:      +xxx xxx xxxx
"""
    AFTER_RECVD_CODE_TEXT = """!
يرجى إرسال الرمز الذي تلقيته من تليجرام

يُستخدم هذا الرمز فقط لغرض الحصول على الايبيات لك من my.telegram.org.
"""
    BEFORE_SUCC_LOGIN = "تم استلام الرمز. جارٍ جمع معلومات الصفحة..."
    ERRED_PAGE = """عذرًا! حدث خطأ. يرجى المحاولة باستخدام الطريقة اليدوية.

كيفية الحصول على معرّف التطبيق ومفتاح API يدويًا:

افتح my.telegram.org/auth
قم بتسجيل الدخول إلى حساب Telegram الخاص بك
انقر على قائمة تطوير واجهة برمجة التطبيقات
قم بملء البيانات التالية:
عنوان التطبيق: tgbot
الاسم القصير: tgbot
عنوان URL: (اتركه فارغًا)
المنصة: سطح المكتب
تم
إذا نجحت في الحصول على المعلومات يدويًا، يرجى المحاولة مرة أخرى باستخدام هذا الروبوت"""
    CANCELLED_MESG = "يرجى ارسال /start للبدء مرة اخرى"
    IN_VALID_CODE_PVDED = "الرمز غير صالح"
    IN_VALID_PHNO_PVDED =  " xxx+ رقم الهاتف الذي ادخلته غير صحيح يرجى ارساله بصيغة دولية مثال"
